Repository: 84000/data-translation-memory
Catalog: Toh_147-The_Teaching_on_the_Great_Compassion_of_the_Tathagata-v1.tmx
Source language: bo
Languages: en

source: གཞན་ལས་འཐུན་པའི་སྒྲ་ཐོས་པ་དང་ཐོས་ནས་ཀྱང་། །ཆོས་རྣམས་སྟོང་པར་ནང་དུ་ཚུལ་བཞིན་རྟོག་བྱེད་པ། །
en: Hearing the agreeable sound of the Dharma from another and, having heard it, Correctly realizing phenomena to be inherently empty

source: དེ་ནི་སྲིད་པའི་མཚོ་ལས་རྣམ་པར་སྒྲོལ་བར་འགྱུར། །
en: Liberates them from the ocean of existence.

source: ཞི་གནས་ལྷག་མཐོང་གཉི་ག་ཟུང་དུ་འབྲེལ་ལྡན་པ། །
en: “ ‘Uniting tranquil abiding and special insight,

source: སྒོམ་པ་གང་དུའང་འགྲོ་བ་མེད་ཅིང་འོང་བ་མེད། །
en: Meditating without any coming or going,

source: དེ་ལ་སྐྱེ་མེད་འཆི་འཕོ་དང་ནི་རྟོག་མེད་དེ། །
en: Where there is no birth, no death, transference, or thought,

source: དེ་ནི་སྐྱོན་མེད་རེག་ཅིང་རྣམ་པར་དག་པར་འགྱུར། །
en: And reaching the immaculate, one becomes purified.

source: རྐང་པར་ལྡན་ནས་རིག་པ་གསུམ་ནི་རྗེས་སུ་ཉལ། །
en: “ ‘Endowed with virtuous conduct and threefold knowledge, there is relaxation.

source: བག་ཡོད་གྱུར་ནས་རྣམ་ཐར་གསུམ་གྱི་སྒོ་ལ་སྒོམ། །
en: Becoming heedful, one cultivates the three gates of liberation.

source: ཟད་པ་དང་ནི་མི་སྐྱེ་ཤེས་དང་བདེན་པ་ཐོབ། །
en: One knows depletion and nonorigination and attains the truth.

source: འདི་ནི་རྣམ་དག་ལམ་དུ་འདྲེན་པའི་རྒྱུ་དང་རྐྱེན། །
en: These are the causes and conditions that direct one onto the path of purification.

source: རྒྱལ་བ་བསམ་གཏན་གཅིག་ལ་ཡང་དག་སྙོམས་ཞུགས་ནས། །འགོག་པར་རེག་སྟེ་དེ་བཞིན་དྲན་དང་ལྡན་པར་བཞེངས། །
en: “ ‘Attaining the first concentration, The victors reach cessation and emerge accordingly with mindfulness.

source: རྗེས་སུ་འཐུན་དང་མི་འཐུན་པ་དང་ཐོད་རྒལ་དུ། །ཆོས་ཀྱི་རྒྱལ་པོ་རྣམ་ཐར་བརྒྱད་ལ་སྙོམས་པར་འཇུག །
en: The Dharma kings attain the eight liberations In sequence, out of sequence, and in nonsequential order.

source: མཚུངས་པ་མེད་པ་མཉམ་པ་ཉིད་ལ་གནས་ནས་ནི། །
en: “ ‘The incomparable abide in a state of equality,

source: ཏིང་འཛིན་གཅིག་ལས་ཏིང་འཛིན་བྱེ་བ་མཐའ་ཡས་སྟོན། །
en: Displaying countless absorptions from a single absorption.

source: སེམས་ལ་འདྲེས་པ་མེད་ཅིང་ཆོས་ལ་རྣམ་རྟོག་མེད། །
en: Their minds are not mixed up in this, and they have no thoughts about phenomena.

source: དེ་ཕྱིར་རྒྱལ་བ་མཉམ་པར་མ་བཞག་སེམས་ཀྱང་མེད། །
en: Therefore, for the victors, their minds are never not in meditative equipoise.

source: གང་དག་ཉན་ཐོས་དེ་བཞིན་རང་རྒྱལ་ཏིང་ངེ་འཛིན། །བྱང་ཆུབ་སེམས་དཔའི་ཏིང་འཛིན་རྣམ་པ་བྱེ་བ་དག །
en: All the millions of śrāvaka and pratyekabuddha absorptions And the absorptions of bodhisattvas.

source: དེ་ཀུན་བདེ་གཤེགས་ཏིང་ངེ་འཛིན་གྱི་ཟིལ་གྱིས་ནོན། །
en: “ ‘A sugata’s absorption surpasses

source: གདམས་པ་ཤེས་ལ་མཁས་པ་བདེ་གཤེགས་འཕྲིན་ལས་སོ། །
en: Knowing and being skilled in their instructions is the activity of the sugatas.’

source: རིགས་ཀྱི་བུ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པས་བདག་དང་སེམས་ཅན་གཞན་རྣམས་དང་། གང་ཟག་གཞན་དག་གི་སྔོན་གྱི་གནས་རྣམ་པ་དུ་མ་རྗེས་སུ་དྲན་ནོ། །
en: (8) “Moreover, son of noble family, the tathāgatas can recollect their own and other beings’ and other individuals’ various former existences.

source: འདི་ལྟ་སྟེ། སྐྱེ་བ་གཅིག་རྗེས་སུ་དྲན་ནོ། །གཉིས་སམ། གསུམ་མམ། བཞིའམ། ལྔའམ། བཅུའམ། ཉི་ཤུའམ། སུམ་ཅུའམ། བཞི་བཅུའམ། ལྔ་བཅུའམ།
en: They can recollect one or two, three or four, five or ten, twenty, thirty, forty, or fifty previous births.

source: སྐྱེ་བ་བརྒྱའམ། སྐྱེ་བ་སྟོང་ངམ། སྐྱེ་བ་བརྒྱ་ཕྲག་སྟོང་ངམ། སྐྱེ་བ་བྱེ་བ་བརྒྱ་ཕྲག་སྟོང་ངམ།
en: They can recollect one hundred or one thousand, one hundred thousand, or billions of births.

source: འཇིག་པའི་བསྐལ་པའམ། འཆགས་པའི་བསྐལ་པའམ། འཇིག་པ་དང་འཆགས་པའི་བསྐལ་པའམ།
en: They can recollect the eon of world destruction, the eon of world formation, and the eon of both destruction and formation.

source: འཇིག་པའི་བསྐལ་པ་དུ་མའམ། འཆགས་པའི་བསྐལ་པ་དུ་མའམ། འཇིག་པ་དང་འཆགས་པའི་བསྐལ་པ་དུ་མ་རྗེས་སུ་དྲན་ནོ། །
en: They can recollect many eons of destruction, many eons of formation, or many eons of destruction and formation.

source: སེམས་ཅན་དེ་དག་མིང་འདི་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: “ ‘These beings went by this or that name.

source: ང་དེར་བྱུང་སྟེ་མིང་ནི་འདི་ཞེས་བྱ། རུས་ནི་འདི་ཞེས་བྱ། རིགས་ནི་འདི་ཞེས་བྱ། ཁ་ཟས་ནི་འདི་ལྟ་བུ་ཞིག་ཟ་ཟ། ཁ་དོག་ནི་འདི་ལྟ་བུ། དབྱིབས་ནི་འདི་ལྟ་བུ།
en: I was born there with that name, in that clan, in that family lineage, eating that food, with that complexion and that shape.

source: ཡུན་ནི་འདི་སྲིད་ཞིག་ཏུ་གནས་གནས། བདེ་བ་དང་སྡུག་བསྔལ་ནི་འདི་ལྟ་བུ་ཞིག་མྱོང་སྟེ།
en: I lived there during that period and experienced those joys and those sorrows.

source: བདག་དེ་ནས་ཤི་འཕོས་ནས་ཆེ་གེ་མོ་ཞིག་ཏུ་སྐྱེས་སོ། །
en: Then, after I died and transmigrated from there, I was reborn as another being.

source: དེ་ནས་ཤི་འཕོས་ནས་འདིར་སྐྱེས་པར་རྣམ་པ་དང་བཅས། ཡུལ་ཕྱོགས་དང་བཅས། གཞི་ཅི་ལས་གྱུར་པ་དང་བཅས་པར་བདག་དང་།
en: Then, after I died and transmigrated from there, I was born here in this form, in this area, from this region.’

source: སེམས་ཅན་གཞན་དག་གི་སྔོན་གྱི་གནས་རྣམ་པ་དུ་མ་རྗེས་སུ་དྲན་ནོ། །
en: Thus they recollect their own and other beings’ various former existences.

source: དེ་སེམས་ཅན་དེའི་སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་ནོ། །
en: “They recollect the former existences of a being.

source: སྔོན་གྱི་རྒྱུ་ཇི་ལྟ་བུ་དང་། རྒྱུ་གང་གིས་སེམས་ཅན་གང་ཀུན་དུ་བྱུང་བ་དེའི་སྔོན་གྱི་རྒྱུ་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏེ།
en: How and through which prior causes a given being was born—the tathāgatas know such prior causes.

source: འདས་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་རྒྱུ་བ་ཡང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “The tathāgatas know the movements of the minds of all past beings.

source: སེམས་ཀྱི་དམིགས་པ་གང་གི་འོག་ཏུ་གང་ལ་དམིགས་པའི་སེམས་སྐྱེ་བ་དང་། དམིགས་པ་གང་གིས་སྐྱེས་པ་དང་། དམིགས་པ་གང་མ་ཚང་བས་འགགས་པ་དེའང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know that following a given objective reference, there arises a mind having such an objective reference, that it has arisen due to the given objective reference, and that it ceases when this objective reference is incomplete.

source: དེ་ལྟར་ཇི་ཙམ་དུ་སེམས་ཅན་གཅིག་གི་སེམས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་དེ་འཇུག་པ་སེམས་དེ་ལྟ་བུ་ཞིག་གི་འོག་ཏུ་སེམས་འདི་ལྟ་བུ་ཞིག་བྱུང་བ་དེ་བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་ཡང་ཚིག་ཏུ་བསྟན་པས་བསྟན་པར་དཀའོ། །
en: The mind of a single being thus exists as an ongoing continuum, in which a given mind occurs following another. Even if one were to speak for as many eons as there are grains of sand in the river Ganges, it would be difficult to explain this with words.

source: དེ་བཞིན་དུ་སེམས་ཅན་ཐམས་ཅད་ཀྱིའང་དེ་ལྟ་བུར་སོ་སོའི་སེམས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “In this way, the tathāgatas know the ongoing continuums of the individual minds of all sentient beings.

source: ཡོངས་སུ་བརྟག་པ་ཉེ་བར་བཟུང་སྟེ་དེ་བཞིན་གཤེགས་པས་ཕྱི་མའི་མཐའི་མུར་ཐུག་པར་བསྟན་ཀྱང་དེའི་ཡེ་ཤེས་མཐར་ཐུག་པར་མི་འགྱུར་རོ། །
en: Even if the tathāgatas were to explain this until the end of time on the basis of rational analysis, their wisdom would not reach its limit.

source: དེ་བཞིན་གཤེགས་པའི་སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པའི་མཁྱེན་པ་འདི་ནི་བསམ་གྱིས་མི་ཁྱབ་ཅིང་མཚུངས་པ་མེད་ལ་ཚད་མེད་དེ།
en: The tathāgata knowledge that recollects previous existences is inconceivable, unequaled, and immeasurable.

source: དེའི་མཐའི་གནས་ནི་བསྟན་པར་སླ་བ་མ་ཡིན་ནོ། །
en: Its scope is not easy to explain.

source: སངས་རྒྱས་ཀྱི་ཁྱུ་མཆོག་ཏུ་གྱུར་པས་དེ་བཞིན་གཤེགས་པ་སེམས་ཅན་དེ་དག་ལ།
en: “Having become buddhas, the supreme leaders, the tathāgatas remind beings,

source: ཀྱེ་སེམས་ཅན་དག་དགེ་བའི་རྩ་བ་སངས་རྒྱས་ལ་བསྐྱེད་པའམ། ཉན་ཐོས་ལ་བསྐྱེད་པའམ། རང་སངས་རྒྱས་ལ་བསྐྱེད་པ་དེ་ལྟ་བུ་
en: ‘Hey sentient beings! Roots of virtue generate either buddhahood, śrāvakahood, or pratyekabuddhahood!

source: དེ་དྲན་པར་གྱིས་ཤིག །དྲན་པར་གྱིས་ཤིག་ཅེས་དྲན་པར་མཛད་དོ། །
en: Remember that! Remember!’

source: འདི་ལྟ་སྟེ། སངས་རྒྱས་ཀྱི་མཐུས་དེ་དག་གིས་ཀྱང་དྲན་པར་འགྱུར་རོ། །
en: In this way, through the power of the buddhas, they also become mindful.

source: དེ་བཞིན་གཤེགས་པས་དེ་དག་ལ་དེ་དགེ་བའི་རྩ་བ་ལ་དམིགས་པ་དེས་གང་གི་ཕྱིར་ཅི་ནས་ཀྱང་ཐེག་པས་རྣམ་པར་གྲོལ་བ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་བ་དེ་ལྟ་དེ་ལྟར་ཆོས་སྟོན་ཏེ།
en: “The tathāgatas teach them the Dharma in such a way that on account of the roots of virtue they observe in those beings, they will ensure that, whichever vehicle these beings take, they do not turn back from liberation.

source: འདི་ནི་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པའི་འཕྲིན་ལས་བརྒྱད་པའོ། །
en: This is the eighth tathāgata activity of the tathāgatas.

source: དེ་ནི་བདག་དང་དེ་བཞིན་གཞན་དག་གི། །སྔོན་གྱི་མཐའ་ནི་བྱེ་བ་ཁྲག་ཁྲིག་དག །ཐུག་པ་མེད་པར་འཇིག་རྟེན་སྒྲོན་མས་དྲན། །
en: “ ‘The lamps of the world recollect without obstruction Countlessly many past existences— Their own and others’—

source: སྐྱུ་རུ་ར་ལྔ་ཕྱག་མཐིལ་བཞག་པ་བཞིན། །
en: Like Indian gooseberries resting in the palm of one’s hand.

source: མིང་རུས་དེ་བཞིན་ཁ་དོག་རྣམ་རྟོག་དང་། །ཚེ་གནས་འཆི་འཕོ་དང་ནི་འགྲོ་བ་དང་། །རྒྱུ་གང་གིས་ནི་སེམས་ཅན་གང་འོངས་པ། །དེ་ལ་དུས་མཁྱེན་ནས་ནི་ཆོས་ཀྱང་སྟོན། །
en: “ ‘Migrating through the transference of death From a lifetime with a certain name, clan, and complexion, with certain thoughts, And having reappeared as another being through a given cause, They teach the Dharma with knowledge of this temporal process.

source: འགྲོ་བའི་སེམས་དང་སེམས་ལས་བྱུང་བའི་ཆོས། །གང་དག་འདས་པ་མཐའ་ཡས་ཐུག་མེད་དང་། །གང་གི་འོག་ཏུ་སེམས་ནི་གང་འབྱུང་བ། །
en: All about the minds of transmigrators and the factors arising from the mind, The past, endless and unimpeded, And what gives rise to any given state of mind.

source: ཡེ་ཤེས་ཆེ་ལྡན་རྒྱལ་བས་ཐམས་ཅད་མཁྱེན། །
en: “ ‘The victors know with their great wisdom

source: སེམས་ཅན་གཅིག་གི་སེམས་ནི་སྔ་མ་གང་། །འདས་པ་གང་ཡིན་བདེ་བར་གཤེགས་པས་མཁྱེན། །བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་སྙེད་དུ། །དེ་ནི་བསྟན་ཀྱང་དེ་ལ་ཐུག་པ་མེད། །
en: “ ‘The sugatas understand What constitute the prior and earlier mind states of a single being. Even if they were to explain them for as many eons As there are grains of sand in the river Ganges, there would be no end to it.

source: གང་ཡང་སྔོན་གྱི་སྤྱོད་པ་བྱེ་བ་དག །མཐའ་ཡས་ཐུག་པ་མེད་པ་བསྟན་ཀྱང་ནི། །མཚུངས་པ་མེད་པའི་ཡེ་ཤེས་མི་ཟད་དེ། །
en: “ ‘Even if they taught The countlessly many prior activities forever, Their unequaled wisdom would not be exhausted.

source: བདེ་གཤེགས་ཡེ་ཤེས་རྒྱ་མཚོ་དེ་འདྲའོ། །
en: That is what the ocean of sugata wisdom is like.

source: སེམས་ཅན་གང་དག་བསམ་པ་དགེ་གྱུར་དང་། །གང་གིས་སྔོན་ཆད་རྒྱལ་བ་བསྟི་སྟང་བྱས། །
en: “ ‘Those beings of virtuous intent Who have shown respect to the victors in the past

source: སངས་རྒྱས་རྫུ་འཕྲུལ་སྟོབས་ཀྱི་ཤུགས་གནས་ཏེ། །སྔོན་ཆད་དཀར་པོ་བྱས་པ་དྲན་པར་བྱེད། །
en: Are made mindful of their previous virtue By the strength of the buddhas’ miraculous power.

source: སྔོན་ཆད་དཀར་པོ་དེས་བྱས་ཅི་འདྲ་བ། །སངས་རྒྱས་མཐུས་ནི་དེ་དག་དྲན་པར་འགྱུར། །
en: “ ‘Mindful of their previous virtue Due to the power of the buddhas,

source: དེ་དྲན་ནས་ཀྱང་ཐེག་པ་གསུམ་གནས་ཏེ། །དེ་དག་ཐར་ལམ་དགེ་ལས་ཕྱིར་མི་ལྡོག །
en: And mindfully abiding in the three vehicles, They do not turn away from the virtuous path of liberation.

source: བདེ་གཤེགས་རྣམས་ཀྱི་སྔོན་བྱུང་མཐའ་ཡས་པ། །སེམས་ཅན་ཀུན་གྱིས་བསམ་པར་མི་ནུས་ཏེ། །
en: Of the limitless sugatas who appeared in the past. “ ‘No sentient being can conceive

source: གང་གིས་སེམས་ཅན་ཐུག་པ་མེད་བཏུལ་བ། །སྐྱེས་བུ་ཆེན་པོ་རྣམས་ཀྱི་འཕྲིན་ལས་བརྒྱད། །
en: The endless taming of sentient beings Is the eighth activity of great beings.’

source: རིགས་ཀྱི་བུ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པས་ལྷའི་མིག་རྣམ་པར་དག་པ་མི་ལས་ཤིན་ཏུ་འདས་པས་སེམས་ཅན་རྣམས་འཆི་འཕོ་དང་། སྐྱེ་བ་དང་། བཟང་པོ་དང་། ངན་པ་དང་། ཁ་དོག་མཛེས་པ་དང་། ཁ་དོག་མི་སྡུག་པ་དང་། བདེ་འགྲོར་འགྲོ་བ་དང་། ངན་འགྲོར་འགྲོ་བ་རྣམས་གཟིགས་སོ། །
en: (9) “Son of noble family, with their pure divine vision, which surpasses that of humans, the tathāgatas observe beings dying, transmigrating, and taking birth. They observe their migrations into happy or sad destinies, their goodness or wickedness, their beautiful or ugly complexions.

source: ཀྱེ་མ་སེམས་ཅན་འདི་དག་ནི་ལུས་ཀྱིས་ཉེས་པར་སྤྱོད་པ་དང་ལྡན་པ། ངག་གིས་ཉེས་པར་སྤྱོད་པ་དང་ལྡན་པ། ཡིད་ཀྱིས་ཉེས་པར་སྤྱོད་པ་དང་ལྡན་པ། འཕགས་པ་རྣམས་ལ་སྐུར་པ་འདེབས་པ། ལོག་པར་ལྟ་བ་དག་སྟེལོག་པར་ལྟ་བའི་ལས་ཡང་དག་པར་བླངས་པའི་རྒྱུས་ལུས་ཞིག་སྟེ་ཤི་བའི་འོག་ཏུ་ངན་སོང་ངན་འགྲོ་ལོག་པར་ལྟུང་བ་སེམས་ཅན་དམྱལ་བ་རྣམས་སུ་སྐྱེ་བར་འགྱུར་རོ། །
en: “ ‘Alas! Regarding those sentient beings who have acted badly either physically, verbally, or mentally, who have denigrated the nobles ones, and who have held wrong views, once their bodies fail and they die they will be born as hell beings, falling into lower realms and miserable destinies because they took up actions based on their wrong views.

source: སེམས་ཅན་འདི་དག་ནི་ལུས་ཀྱིས་ལེགས་པར་སྤྱོད་པ་དང་ལྡན་པ། ངག་གིས་ལེགས་པར་སྤྱོད་པ་དང་ལྡན་པ། ཡིད་ཀྱིས་ལེགས་པར་སྤྱོད་པ་དང་ལྡན་པ། འཕགས་པ་རྣམས་ལ་སྐུར་པ་མི་འདེབས་པ། ཡང་དག་པར་ལྟ་བ་དག་སྟེཡང་དག་པར་ལྟ་བ་ཡང་དག་པར་བླངས་པའི་རྒྱུས་ལུས་ཞིག་སྟེ་ཤི་བའི་འོག་ཏུ་བདེ་འགྲོ་མཐོ་རིས་ཀྱི་འཇིག་རྟེན་དུ་ལྷ་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འགྱུར་རོ་
en: “ ‘Regarding those sentient beings who have acted virtuously either physically, verbally, or mentally, who have not denigrated the noble ones, and who have held correct views, once their bodies fail and they die they will be born among gods in the higher realms and blissful destinies because they took up correct views.’

source: ཞེས་ཇི་ལྟར་ལས་ཀྱིས་ཉེ་བར་འགྲོ་བའི་སེམས་ཅན་དག་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Thus tathāgatas know how beings migrate due to actions.

source: དེ་ལ་དེ་བཞིན་གཤེགས་པའི་ལྷའི་མིག་ནི་འདི་ཡིན་ཏེ།
en: “The divine tathāgata vision is like this:

source: མིག་དེས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་ཆོས་ཀྱི་དབྱིངས་ཀྱིས་ཀླས་པ། ནམ་མཁའི་ཁམས་ཀྱི་མཐས་གཏུགས་པ། ཚད་མེད་པ། གྲངས་མེད་པ། བགྲང་བ་ལས་ཤིན་ཏུ་འདས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དག་ན་ཞིང་གང་དག་ཁ་ཅིག་སྣང་བ་དེ་དག་ཐམས་ཅད་ནི་འཇིག་པ་དང་འཆགས་པར་གཟིགས་སོ། །
en: It observes the destruction and formation of the worlds of the ten directions, all those that appear as fields in the limitless, innumerable, and incalculable buddhafields reaching to the end of space, the limitless realm of phenomena.

source: སེམས་ཅན་གང་དག་ཁ་ཅིག་སྣང་བ་དེ་དག་ཐམས་ཅད་ནི་འཆི་འཕོ་བ་དང་སྐྱེ་བར་གཟིགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་གང་དག་ཁ་ཅིག་སྣང་བ་དེ་དག་ཐམས་ཅད་ནི་འཆི་འཕོ་བ་དང་། མངལ་དུ་འཇུག་པ་དང་། བཙའ་བར་གཟིགས་སོ། །
en: It observes the death, transmigration, and rebirth of all those beings who appear and the death, conception, and rebirth of all those bodhisattvas who appear.

source: སངས་རྒྱས་གང་དག་ཁ་ཅིག་སྣང་བ་དེ་དག་ཐམས་ཅད་ནི་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་དང་། ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་བ་དང་། ཚེའི་འདུ་བྱེད་འདོར་བ་དང་། ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་གཟིགས་སོ། །
en: It observes the buddhas who appear attaining complete and perfect buddhahood, turning the wheel of Dharma, relinquishing the physical body, and entering into parinirvāṇa.

source: ཉན་ཐོས་གང་དག་ཁ་ཅིག་སྣང་བ་དེ་དག་ཐམས་ཅད་ནི་རྣམ་པར་འགྲོལ་བ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་གཟིགས་སོ། །
en: It observes the śrāvakas who appear becoming free and entering parinirvāṇa.

source: རང་སངས་རྒྱས་གང་དག་ཁ་ཅིག་སྣང་བ་དེ་དག་ཐམས་ཅད་ནི་རྫུ་འཕྲུལ་སྟོན་ཅིང་ཡོན་སྦྱོང་བར་གཟིགས་སོ། །
en: And it observes the pratyekabuddhas who appear displaying miracles and purifying gifts.

source: སེམས་ཅན་གང་དག་སྣང་བར་མ་གྱུར་པ་དག་དང་། གང་དག་ཕྱི་རོལ་གྱི་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ་རྣམས་ཀྱིས་མིག་གི་ལམ་དུ་མ་གྱུར་པ་དང་། ཉན་ཐོས་རྣམས་ཀྱི་མ་ཡིན་པ་དང་། རང་སངས་རྒྱས་རྣམས་ཀྱི་མ་ཡིན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དག་གི་མ་ཡིན་པ་དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པ་ལྷའི་མིག་ལ་སྣང་བར་འགྱུར་རོ། །
en: “Beings who do not appear and who are invisible for the five non-Buddhist superknowledges, for śrāvakas, for pratyekabuddhas, and for bodhisattvas—even they are visible to the divine tathāgata vision.

source: ཡང་ཤིང་རྟའི་ཕང་ལོ་ཙམ་གྱི་ས་ཕྱོགས་ན་སྣང་བར་མ་གྱུར་པའི་སེམས་ཅན་གང་དག་དེ་བཞིན་གཤེགས་པ་ལ་སྣང་བར་གྱུར་པ་དེ་དག་ནི་ཆེས་མང་གི །སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་ལྷ་དང་མི་རྣམས་ནི་དེ་ལྟ་མ་ཡིན་ཏེ
en: “Furthermore, those beings who are invisible in Jambudvīpa are visible to the tathāgatas. The gods and humans of the world realms of the vast trichiliocosm do not see them.

source: དེ་ལྟར་སྣང་བར་མ་གྱུར་པའི་སེམས་ཅན་གྱི་ཁམས་ནི་ཚད་མེད་དོ། །
en: The realms of such invisible beings are limitless.

source: དེ་ལྟར་སངས་རྒྱས་ཀྱིས་འདུལ་བའི་སེམས་ཅན་གང་ཡིན་ཞེས་དེ་བཞིན་གཤེགས་པའི་ལྷའི་མིག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་སེམས་ཅན་གྱི་ཁམས་ལ་རྣམ་པར་གཟིགས་ཏེ།
en: “The divine tathāgata vision scans the realms of beings in all buddhafields, asking, ‘Who are the beings to be tamed by the buddhas?’

source: སངས་རྒྱས་ཀྱིས་འདུལ་བའི་སེམས་ཅན་གྱི་རིས་ཇི་སྙེད་པ་དེ་དག་གི་མདུན་ན་དེ་སྙེད་ཀྱི་དེ་བཞིན་གཤེགས་པ་བཞུགས་ཤིང་སེམས་ཅན་དེ་དག་འདུལ་ཡང་དེ་དག་མ་ཡིན་པའི་སེམས་ཅན་གཞན་གྱིས་མི་ཤེས་ཏེ
en: For as many kinds of beings to be tamed by the buddhas as exist, that many tathāgatas abide in their presence. Even as they tame these beings, other beings remain unaware of this.

source: འདི་ནི་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པའི་འཕྲིན་ལས་དགུ་པའོ། །
en: This is the ninth tathāgata activity of the tathāgatas.

source: དེ་བཞིན་གཤེགས་པའི་ལྷ་ཡི་མིག་ནི་དྲི་མེད་འོད་གསལ་ཏེ། །མིག་ནི་རྣམ་སྦྱངས་མཐའ་ཡས་བསོད་ནམས་གཟི་བརྗིད་གཟི་བརྗིད་གྱུར། །
en: “ ‘The divine vision of tathāgatas is unstained and luminous, Purified, limitless, meritorious, and splendid.

source: ཕྱོགས་བཅུ་དག་གི་ཞིང་རྣམས་ཀུན་དུ་མཚན་ཉིད་རྣམ་གཟིགས་ཏེ། །
en: It beholds the attributes throughout all the fields of the ten directions—

source: གང་དག་འབྱུང་དང་གང་དག་འབྱུང་བར་འགྱུར་དང་གང་དག་བྱུང་། །
en: All that appears, will appear, and has appeared.

source: དེ་ན་སེམས་ཅན་གཟུགས་ཅན་གཟུགས་མེད་གང་དག་ཡོད་པ་དང་། །བདེ་འགྲོ་ངན་འགྲོ་དག་ན་རབ་འབྲིང་ཐ་མ་གང་མཆི་དང་། །སྡིག་པ་བྱེད་པ་གང་དག་ངན་འགྲོ་རྣམས་སུ་འགྲོ་བ་དང་། གང་ཡང་མཐོ་རིས་བསོད་ནམས་ལས་ཅན་དེ་དག་རྒྱལ་བས་གཟིགས། །
en: “ ‘There the victors observe beings—whether they have form or not, Whether they exist in happy or miserable destinies, whether they are excellent, average, or inferior, And whether they are evildoers migrating toward the miserable existences Or the meritorious and karmically fortunate in the higher realms.

source: བྱང་ཆུབ་སེམས་དཔའ་གང་དག་ཞིང་རྣམས་ཀུན་ན་སྤྱད་སྤྱོད་དང་། །མངལ་དུ་འཇུག་དང་འབྱུང་དང་བྱང་ཆུབ་ཤིང་དྲུང་འགྲོ་བ་དང་། །གང་དག་ལ་ལ་བྱང་ཆུབ་ཤིང་དྲུང་གནས་ནས་བདུད་འདུལ་བ། །
en: Bodhisattvas engaged in their conduct in all the fields, Entering the womb, appearing, proceeding toward the tree of awakening, And taming Māra while seated in front of the tree of awakening.

source: དེ་ཀུན་སངས་རྒྱས་ཐམས་ཅད་གཟིགས་པས་ལྷ་ཡི་མིག་གིས་གཟིགས། །
en: “ ‘The divine vision of the all-seeing buddhas beholds

source: སངས་རྒྱས་ཆོས་ཀྱི་རྒྱལ་པོ་གང་དག་བྱང་ཆུབ་མཆོག་སངས་རྒྱས། །གང་དག་ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་ཞིང་ལྷ་དང་མི་རྣམས་འགྲོལ། །སངས་རྒྱས་མཛད་པ་མཆོག་མཛད་ནས་ནི་རྒྱལ་བ་ཚེ་འདོར་དང་། །གང་ཡང་མྱ་ངན་འདས་པ་སྟོན་པ་དེ་དག་རྒྱལ་བས་གཟིགས། །
en: “ ‘The victors observe buddhas who are Dharma kings, who awaken to supreme awakening, Who turn the wheel of the Dharma, and who liberate gods and humans, Discarding the physical form of a victor after performing supreme buddha deeds And demonstrating nirvāṇa.

source: གང་དག་འདྲེན་པའི་ཆོས་ཐོས་ནས་ནི་ཚུལ་བཞིན་རབ་སྦྱོར་བ། །དམ་པ་བསིལ་བར་གྱུར་པ་རིམས་མེད་ཞི་བའི་གནས་ལ་རེག །གང་ཡང་བདག་ཀྱང་ཆོས་ཐོས་ནས་ནི་སྲིད་པའི་རྒྱ་མཚོ་ལས། །བརྒལ་ཏེ་བདེ་བ་ཕ་རོལ་ཕྱིན་པ་དེ་དག་རྒྱལ་བས་གཟིགས། །
en: “ ‘The victors observe those who hear the guiding Dharma and apply themselves correctly, Becoming noble, cool, and free of illness and reaching a state of peace; Hearing the Dharma, they think, “I will also cross the ocean of existence And arrive at the state of transcendent bliss.”

source: གསང་བ་པ་དང་ཉན་ཐོས་རང་རྒྱལ་བྱང་ཆུབ་སེམས་དཔའ་ཡི། །ལྷ་མིག་ལམ་དུ་མ་གྱུར་སེམས་ཅན་ཁམས་ནི་མཐའ་ཡས་གང་། །དེ་བཞིན་གཤེགས་པའི་ལྷ་མིག་རྣམ་དག་དྲི་མ་མེད་པ་ཡིས། །སེམས་ཅན་ཀུན་གྱི་ལུས་ཕྲ་ཤིན་ཏུ་གནས་པ་རྣམས་ཀྱང་གཟིགས། །
en: “ ‘The tathāgatas’ pure and unstained divine vision Observes all beings present in very subtle bodies As well as the endless masses of beings invisible to the divine vision Of guhyakas, śrāvakas, pratyekabuddhas, and bodhisattvas.

source: གང་ཡང་ཕང་ལོ་ཙམ་ལ་སེམས་ཅན་ཁམས་ཕྲ་རྒྱལ་བས་གཟིགས། །
en: “ ‘The victors observe the subtle realms of beings in Jambudvīpa,

source: དེ་ནི་ཆེས་མང་སྟོང་གསུམ་ལྷ་མི་སྐྱེ་དགུ་དེ་ལྟ་མིན། །
en: Those whom the various beings, god or human, in the great many trichiliocosms do not see.

source: འགྲོ་བ་ཡངས་པ་དག་ན་སེམས་ཅན་ཁམས་འཁོར་མཐའ་ཡས་པ། །རབ་ཏུ་ཤེས་ཀྱང་ཐམས་ཅད་གཟིགས་ལ་སེམས་ཅན་འདུ་ཤེས་མེད། །
en: They know the endless cycling of the mass of beings through vast destinies, Yet beings do not have any conception of their all-encompassing vision.

source: དེ་བཞིན་གཤེགས་པས་འདུལ་བའི་སེམས་ཅན་དབང་པོ་རྣོ་བ་གང་། །དེ་ཡི་མདུན་ན་འཇིག་རྟེན་མགོན་པོ་ཆོས་མཆོག་གསུང་ཡང་ནི། །སེམས་ཅན་ཚོགས་གཞན་གང་གིས་ཀྱང་ནི་དེ་བཞིན་གཤེགས་མི་མཐོང་། །
en: “ ‘Even though the world protectors teach the supreme Dharma Before those tathāgatas’ trainees who have sharp faculties, Beings in other crowds do not see the tathāgatas at all.

source: འདི་ནི་འདྲེན་པའི་ལྷ་ཡི་མིག་གི་སྟོབས་ཀྱི་འཕྲིན་ལས་ཡིན། །
en: This is the activity of the power of the guides’ divine vision.’

source: རིགས་ཀྱི་བུ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་ཟག་པ་ཐམས་ཅད་ཟད་པས་བདག་སྐྱེ་བ་ནི་ཟད། ཚངས་པར་སྤྱོད་པ་ནི་བསྟེན། བྱ་བ་ནི་བྱས་ཏེ། འདི་ལས་སྲིད་པ་གཞན་མི་ཤེས་སོ་ཞེས་ཟག་པ་མེད་པ། སེམས་རྣམ་པར་གྲོལ་བ། རང་གི་མངོན་པར་ཤེས་པས་མངོན་སུམ་དུ་བྱས་ནས་རྫོགས་པར་བྱས་ཏེ་གནས་སོ། །
en: (10) “Son of noble family, the tathāgatas have accomplished perfection. Through their own superknowledge they have actualized the nonexistence of contaminants and the liberation of their minds: ‘Due to the depletion of all contaminants, rebirth has come to an end. I have relied on pure conduct and done what had to be done, and I will not know any other existence after this one.’

source: དེ་ལ་དེ་བཞིན་གཤེགས་པའི་ཟག་པ་ཟད་པ་མཁྱེན་པ་དེ་ནི་དག་པ། དྲི་མ་མེད་པ། ཡོངས་སུ་དག་པ། འོད་གསལ་བ། བག་ཆགས་ཀྱིས་མཚམས་སྦྱོར་བ་ཐམས་ཅད་ལེགས་པར་བཅོམ་པའོ། །
en: “The tathāgata knowledge of the depletion of contaminants is pure, stainless, completely pure, luminous, and destroys all karmic traces.

source: ཉན་ཐོས་རྣམས་ཀྱི་ཟག་པ་ཟད་པ་ནི་ཚད་ཡོད་པའི་བག་ཆགས་ལེགས་པར་མ་བཅོམ་པའོ། །
en: The śrāvaka depletion of contaminants is limited and does not destroy the karmic traces.

source: རང་སངས་རྒྱས་རྣམས་ཀྱི་ཟག་པ་ཟད་པ་ནི་ཚད་ཡོད་པ། སྙིང་རྗེ་ཆེན་པོ་དང་བྲལ་བ། སྤོབས་པ་དང་བྲལ་བའོ། །
en: The pratyekabuddha depletion of contaminants is also limited and is lacking in great compassion and courage.

source: དེ་བཞིན་གཤེགས་པའི་ཟག་པ་ཟད་པ་ནི་རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པ་དང་།
en: “The tathāgata depletion of contaminants is supreme in every respect.

source: བག་ཆགས་ཀྱིས་མཚམས་སྦྱོར་བ་ཐམས་ཅད་ལེགས་པར་བཅོམ་པ།
en: It destroys all karmic traces.

source: སྙིང་རྗེ་ཆེན་པོས་ཀུན་དུ་བཟུང་བ།
en: It is sustained by great compassion.

source: མི་འཇིགས་པ་དང་སྤོབས་པ་དང་མ་བྲལ་བ།
en: It is not lacking in fearlessness or courage.

source: འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་ཟིལ་གྱིས་མི་ནོན་པ་སྟེ།
en: It is unsurpassed in all worlds.

source: སེམས་ཀྱི་སྐད་ཅིག་གཅིག་དང་ལྡན་པའོ། །
en: It consists of a single mental moment.

source: དེ་བཞིན་གཤེགས་པ་ལ་ལས་ཀྱི་བག་ཆགས་མེད། ཉོན་མོངས་པའི་བག་ཆགས་མེད། སྤྱོད་ལམ་འཁྲུལ་པའི་བག་ཆགས་མེད་དོ། །
en: For the tathāgatas, there are no karmic traces of actions, afflictive emotions, or deluded conduct.

source: འདི་ལྟ་སྟེ། དཔེར་ན་ནམ་མཁའ་རང་བཞིན་གྱིས་ཡོངས་སུ་དག་པས་རྡུལ་དང་དུ་བ་དང་ལྷན་ཅིག་མི་གནས་པ་
en: To illustrate, since space is pure by nature, it is impossible for dust particles and smoke to coexist with it.

source: དེ་བཞིན་དུ། དེ་བཞིན་གཤེགས་པའི་ཟག་པ་ཟད་པ་མཁྱེན་པ་དེ་ཡང་ལས་དང་ཉོན་མོངས་པའི་བག་ཆགས་ཐམས་ཅད་དང་ལྷན་ཅིག་མི་གནས་སོ། །
en: In the same way, it is impossible for the tathāgata knowledge of the depletion of contaminants to coexist with the karmic traces of actions or afflictive emotions.

source: དེ་ཟག་པ་ཟད་པ་མཁྱེན་པ་དེ་འདི་ལྟ་བུ་ལ་རབ་ཏུ་གནས་མ་ཐག་ཏུ་ཟག་པ་དང་བཅས་པ་ལེན་པ་དང་བཅས་པའི་སེམས་ཅན་རྣམས་ལ་ཟག་པ་ཟད་པར་བྱ་བ་དང་། ལེན་པ་སྤང་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: Thus, as soon as the knowledge of the depletion of contaminants is present, they teach the Dharma to afflicted and grasping sentient beings so that they in turn will give up their grasping, and so that their defilements will be depleted:

source: ཀྱེ་མ་སེམས་ཅན་ཡང་དག་པ་མ་ཡིན་པ་ཀུན་དུ་རྟོག་པ་ལས་ཀུན་དུ་བྱུང་བ་དག་ཁྱེད་ཟག་པ་དང་ལེན་པ་དེ་དག་ལ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་སོ་སོར་རྟོགས་ཤིག་ཅེས་
en: ‘Alas, you sentient beings who come to be through unreal conceptualization, you should understand contaminants and grasping in accordance with reality!’
